espruino/Espruino/targets/stm32/jshardware.c
static unsigned int jshGetSPIFreq(SPI_TypeDef *SPIx) {
  RCC_ClocksTypeDef clocks;
  RCC_GetClocksFreq(&clocks);
  bool APB2 = SPIx == SPI1;
  return APB2 ? clocks.PCLK2_Frequency : clocks.PCLK1_Frequency;
}

// ----------------------------------------------------------------------------
volatile unsigned int ticksSinceStart = 0;
#ifdef USE_RTC
// Average time between SysTicks
volatile unsigned int averageSysTickTime=0, smoothAverageSysTickTime=0;
// last system time there was a systick
volatile JsSysTime lastSysTickTime=0, smoothLastSysTickTime=0;
// whether we have slept since the last SysTick
bool hasSystemSlept;

#else
volatile JsSysTime SysTickMajor = SYSTICK_RANGE;
#endif

static bool jshIsRTCUsingLSE() {
  return (RCC->BDCR & (RCC_RTCCLKSource_LSE|RCC_RTCCLKSource_LSI)) == RCC_RTCCLKSource_LSE;
}

static bool jshIsRTCAlreadySetup(bool andRunning) {
  if ((RCC->BDCR & RCC_BDCR_RTCEN) == 0)
    return false; // RTC was off - return false
  if (!andRunning) return true;
  // Check what we're running the RTC off and make sure that it's running!
  if (jshIsRTCUsingLSE())
    return RCC_GetFlagStatus(RCC_FLAG_LSERDY) == SET;
  else
    return RCC_GetFlagStatus(RCC_FLAG_LSIRDY) == SET;
}

#ifdef USE_RTC
void jshSetupRTCPrescaler(bool isUsingLSI) {
  if (isUsingLSI) {
#ifdef STM32F1
    jshRTCPrescaler = 40000; // 40kHz for LSI on F1 parts
#else
    jshRTCPrescaler = 32000; // 32kHz for LSI on F4
#endif
  } else {
    jshRTCPrescaler = 32768; // 32.768kHz for LSE
  }
  jshRTCPrescalerReciprocal = (unsigned short)((((unsigned int)JSSYSTIME_SECOND) << RTC_PRESCALER_RECIPROCAL_SHIFT) /  jshRTCPrescaler);
}

void jshSetupRTC(bool isUsingLSI) {
  RCC_RTCCLKConfig(isUsingLSI ? RCC_RTCCLKSource_LSI : RCC_RTCCLKSource_LSE); // set clock source to low speed internal
  jshSetupRTCPrescaler(isUsingLSI);
  RCC_RTCCLKCmd(ENABLE); // enable RTC (in backup domain)
  RTC_WaitForSynchro();
#ifdef STM32F1
  RTC_SetPrescaler(jshRTCPrescaler - 1U);
  RTC_WaitForLastTask();
#else
  RTC_InitTypeDef RTC_InitStructure;
  RTC_StructInit(&RTC_InitStructure);
  //RTC_InitStructure.RTC_AsynchPrediv = 0x7F;
  //RTC_InitStructure.RTC_SynchPrediv =  0xFF; /* (32KHz / (RTC_AsynchPrediv+1)) - 1 = 0xFF */
  RTC_InitStructure.RTC_AsynchPrediv = 0;
  RTC_InitStructure.RTC_SynchPrediv =  (uint32_t)(jshRTCPrescaler-1); // TODO: RTC_AsynchPrediv larger for power consumption - but then timestamps are less accurate
  RTC_InitStructure.RTC_HourFormat = RTC_HourFormat_24;
  RTC_Init(&RTC_InitStructure);
#endif
}
#endif

void jshDoSysTick() {
  /* Handle the delayed Ctrl-C -> interrupt behaviour (see description by EXEC_CTRL_C's definition)  */
  if (execInfo.execute & EXEC_CTRL_C_WAIT)
    execInfo.execute = (execInfo.execute & ~EXEC_CTRL_C_WAIT) | EXEC_INTERRUPTED;
  if (execInfo.execute & EXEC_CTRL_C)
    execInfo.execute = (execInfo.execute & ~EXEC_CTRL_C) | EXEC_CTRL_C_WAIT;

  if (ticksSinceStart!=0xFFFFFFFF)
    ticksSinceStart++;
 #ifdef USE_RTC
  if (ticksSinceStart==RTC_INITIALISE_TICKS) {
    // Use LSI if the LSE hasn't stabilised
    bool isUsingLSI = RCC_GetFlagStatus(RCC_FLAG_LSERDY)==RESET;

    // If the RTC is already doing the right thing, do nothing
    if (isUsingLSI == jshIsRTCUsingLSE()) {
      // We just set the RTC up, so we have to reset the
      // backup domain again to change sources :(
#ifdef STM32F1
      uint32_t time = RTC_GetCounter();
#else
      RTC_TimeTypeDef time;
      RTC_DateTypeDef date;
      RTC_GetTime(RTC_Format_BIN, &time);
      RTC_GetDate(RTC_Format_BIN, &date);
#endif
      RCC_BackupResetCmd(ENABLE);
      RCC_BackupResetCmd(DISABLE);
      RCC_LSEConfig(RCC_LSE_ON); // reset would have turned LSE off
#ifdef STM32F1
      RTC_SetCounter(time);
#else
      RTC_SetDate(RTC_Format_BIN, &date);
      RTC_SetTime(RTC_Format_BIN, &time);
#endif
      jshSetupRTC(isUsingLSI);
    }

    // Disable RTC clocks depending on what we decided...
    if (isUsingLSI) {
      // LSE is not working - turn it off and use LSI
      RCC_LSEConfig(RCC_LSE_OFF);  // disable low speed external oscillator
    } else {
      // LSE working! Yay! turn LSI off now
      RCC_LSEConfig(RCC_LSE_ON);
      RCC_LSICmd(DISABLE); // disable low speed internal oscillator
    }
  }

  JsSysTime time = jshGetRTCSystemTime();
  if (!hasSystemSlept && ticksSinceStart>RTC_INITIALISE_TICKS) {
    /* Ok - slightly crazy stuff here. So the normal jshGetSystemTime is now
     * working off of the SysTick again to get the accuracy. But this means
     * that we can't just change lastSysTickTime to the current time, because
     * there will be an apparent glitch if SysTick happens when measuring the
     * length of a pulse.
     */
    smoothLastSysTickTime = smoothLastSysTickTime + smoothAverageSysTickTime; // we MUST advance this by what we assumed it was going to advance by last time!
    // work out the 'real' average sysTickTime
    JsSysTime diff = time - lastSysTickTime;
    // saturate...
    if (diff < 0) diff = 0;
    if (diff > 0xFFFFFFFF) diff = 0xFFFFFFFF;
    // and work out average without overflow (averageSysTickTime*3+diff)/4
    averageSysTickTime = (averageSysTickTime>>1) +
                         (averageSysTickTime>>2) +
                         ((unsigned int)diff>>2);
    // what do we expect the RTC time to be on the next SysTick?
    JsSysTime nextSysTickTime = time + (JsSysTime)averageSysTickTime;
    // Now the smooth average is the average of what we had, and what we need to get back in line with the actual time
    diff = nextSysTickTime - smoothLastSysTickTime;
    // saturate...
    if (diff < 0) diff = 0;
    if (diff > 0xFFFFFFFF) diff = 0xFFFFFFFF;
    smoothAverageSysTickTime = (smoothAverageSysTickTime>>1) +
                               (smoothAverageSysTickTime>>2) +
                               ((unsigned int)diff>>2);
  } else {
    hasSystemSlept = false;
    smoothLastSysTickTime = time;
    smoothAverageSysTickTime = averageSysTickTime;
    // and don't touch the real average
  }
  lastSysTickTime = time;
#else
  SysTickMajor += SYSTICK_RANGE;
#endif

  /* One second after start, call jsinteractive. This is used to swap
   * to USB (if connected), or the Serial port. */
  if (ticksSinceStart == 5) {
    jsiOneSecondAfterStartup();
  }
}

// ----------------------------------------------------------------------------

